[
{
    "id":"additionalinfo",
    "beforeApply":"Ensure you have met the academic and English Language requirements for the programme.\nEnsure you have the scanned copies of the supporting documents (in PDF format) on hand for uploading and entry in the e-application form.\nApplications with incomplete, inaccurate information and not accompanied by supporting documents will NOT be processed and considered.\nApply at https://simconnect.simge.edu.sg before the closing date.\nIf you have forgotten your SIM login ID/password, please contact Student Recruitment at study@sim.edu.sg or 6248 9746.\nFor an international applicant applying to a full-time programme, you must submit an online Student’s Pass (STP) application form. Your Student’s Pass application is subjected to approval of the Singapore Immigration & Checkpoints Authority (ICA).",
    "supportDocument":"1.Educational certificates (e.g. ‘O’ and ‘A’ level certificates, diplomas, degree certificate, exam transcripts, etc). Translated and notarised copies are required if documents are not in English. By the application closing date, you must have attained the minimum qualification required for the programme.\n2.NRIC or FIN/passport (for international applicants).\n3.Passport-sized photograph. Your photo must be taken in the last 3 months. It is to be in JPEG format, 400 by 514 pixels, and file size of around 60KB.\n4.Statement of purpose, CV and two reference letters (applicable for University of Warwick and University of Birmingham Postgraduate/Master programmes).",
    "applicationFee":"An application fee is payable for each application form that is submitted. This fee (inclusive of 7% GST) is non-refundable and non-transferable. The fee will be refunded fully only if the intake does not commence. Unpaid applications will not be processed.\nAn application fee is payable for each application form that is submitted. This fee (inclusive of 7% GST) is non-refundable and non-transferable. The fee will be refunded fully only if the intake does not commence. Unpaid applications will not be processed.\n*This does not include all fees related to Student’s Pass application.\nMasterCard / Visa credit card or eNETS can be used to pay application fee.",
    "verifyDocument":"SIM Campus is currently closed.\nLocal applicants are encouraged to send in their OpenCerts file to SIM for verification.\nInternational applicants can mail in the original notarised documents to SIM for verification.\nAlternatively, applicants could also bring their original documents for verification at Student Recruitment Centre, SIM HQ Block A, Level 2, once the campus reopens or when classes commence in SIM.",
    "applicationOutcome":"Applicants will be informed by e-mail of the application outcome within one month before the course starts.\nWhen you have received the offer, you must go online to confirm the offer and accept the student contract document."
}

]